xmlsamples/DAS_Query/PI-TW-GetDeliveryServices-AIS-TWD00.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
         <channel>
            <type>H2H</type>
            <name>KTB Bank</name>
            <version>9500</version>
         </channel>
         <!--foreign_remote_system>
				<identifier>WGHHTWH821P</identifier>
				<reference_no>WU15101020038813</reference_no>
				<counter_id>TWH82EPP001A</counter_id>
			</foreign_remote_system-->
         <foreign_remote_system>
            <identifier>WGWDTWD000T</identifier>
            <reference_no>WU15101020038813</reference_no>
            <counter_id>TWD00WDPFP1A</counter_id>
         </foreign_remote_system>
         <name>GetDeliveryServices</name>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>TW USD</queryfilter2>
            <queryfilter3>PH PHP</queryfilter3>
            <queryfilter4>ALL</queryfilter4>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>